month_int = int(input('Введите месяц числом от 1 до 12: '))
seasons_lst = ['Зима', 'Зима', 'Весна', 'Весна', 'Весна', 'Лето', 'Лето', 'Лето', 'Осень', 'Осень', 'Осень',
               'Зима']
seasons_dict = {
    'Зима': [1, 2, 12],
    'Весна': [3, 4, 5],
    'Лето': [6, 7, 8],
    'Осень': [9, 10, 11]
}

# через словарь
for i in seasons_dict.keys():
    if month_int in seasons_dict[i]:
        print(f'Сезон вашего месяца: {i}')

# через список
print(f'Сезон вашего месяца: {seasons_lst[month_int - 1]}')
